#+BLOG: noise on the net
#+POSTID: 149
#+DATE: [2022-11-20 dom 20:06]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Language learning
#+TAGS: Python
#+DESCRIPTION: how are values created in the source code of python, how to create basic expressions and use basic containers
#+title: Python tutorial: literals, values, operators and expressions

https:/noise/wp-content/uploads/2023/08/david-clode-5uU8HSpfwkI-unsplash-2-scaled.jpg

Photo by [[https://unsplash.com/@davidclode?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText][David Clode]] on [[https://unsplash.com/photos/5uU8HSpfwkI?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText][Unsplash]]


This post is the first of a series; I'd like to share some python knowledge
starting from very basic information and avoiding forward references as much as
possible.

As python evolves I'll try to keep up with latest updates, I'll be treating
python 3 only. This post was started on Saturday, November 19th 2022.

I reccommend to use the basic python interactive command line to really have an
immediate feedback of what python actually does.

Of course there are more convenient interactive environments, but all of them
introduce some complexity which makes it difficult to have a clear mental model
of the language
**  Splices
In order to show some result, starting from this paragraph I will use the
~print~ function. A more detailed description of functions will be presented
later.

When applied to lists, the square bracket operator accepts splices, returning
sublists.

A splice has two possible forms
- start : stop
- start : stop : step

Where start, stop and step are integers.

The first represent the first index to be taken, the second the first excluded
index and the step represent the periodicity of the extraction

All three elements are optional, when missing
- start will point to the beginning of the string
- end will point to the end of the string
- step will be 1

Negative steps are allowed: switching the meaning of start and stop
#+begin_src python :eval never-export :results output :exports both
print(["the", "quick", "brown", "fox", "jumps", "over", "the", "lazy", "dog"][1:4])
print(["the", "quick", "brown", "fox", "jumps", "over", "the", "lazy", "dog"][1:6:2])
print(["the", "quick", "brown", "fox", "jumps", "over", "the", "lazy", "dog"][:4])
print(["the", "quick", "brown", "fox", "jumps", "over", "the", "lazy", "dog"][4::2])
print(["the", "quick", "brown", "fox", "jumps", "over", "the", "lazy", "dog"][-3:9:2])
#+end_src

#+RESULTS:
: ['quick', 'brown', 'fox']
: ['quick', 'fox', 'over']
: ['the', 'quick', 'brown', 'fox']
: ['jumps', 'the', 'dog']
: ['the', 'dog']

**  Accessing strings with index and splice
index and splice work in the very same way with strings as they do with lists

#+begin_src python :eval never-export :results output :exports both
print("abcdefghijklmno"[5])
print("abcdefghijklmno"[-3])
print("abcdefghijklmno"[:4])
print("abcdefghijklmno"[-5:])
print("abcdefghijklmno"[2:8:2])
#+end_src

#+RESULTS:
: f
: m
: abcd
: klmno
: ceg

**  Tuple literals
Tuple can contain ordered sequences of various kinds of objects, as list do

Tuple literal constructor is the comma, but as the empty tuple is represented by
an empty parens () usually parens are always used in tuple literals for better readability

Indices and tuples also apply as in lists; the main difference with list is
related to mutability, a theme I will explain later.

#+begin_src python :eval never-export :results output :exports both
print((True,"hi",3.14159,0+1j)[-1])
print((True,"hi",3.14159,0+1j)[2])
print((True,"hi",3.14159,0+1j)[:3])
#+end_src

#+RESULTS:
: 1j
: 3.14159
: (True, 'hi', 3.14159)

**  Operators on lists and tuples
as we already saw with strings the + operator concatenates lists and tuples with
similar containers (i.e. tuples can't be concatenated with lists and vice versa)

The * operator with an integer repeats the content of the sequence

#+begin_src python :eval never-export :results output :exports both
print(["This", "is", "not"] + ["America"])
print(("hi", "ho") * 3)
#+end_src

#+RESULTS:
: ['This', 'is', 'not', 'America']
: ('hi', 'ho', 'hi', 'ho', 'hi', 'ho')

**  String formatting with modulo and tuples
the modulo operator accepts a string on the left side and a tuple or a list on
the right side.

the result is equivalent to the c "sprintf" function: the string content will be
interpolated with the content of the sequence; placeholders begin with a % sign
and use a letter code to define the expected type of datum. Here is an incomplete list

| sequence | data type                    |
|----------+------------------------------|
| %s       | any object                   |
| %d       | integers                     |
| %f       | numbers (fixed point format) |
| %e       | numbers (scientific format)  |

Between the % sign and the letter some combination of digits and symbols can
modify the output; here are some example: please refer to a printf manual for
more details

#+begin_src python :eval never-export :results output :exports both
print("|%10s| and |%-10s| space padding" % ("positive", "negative"))
print("fixed point %.4f and scientific %.4e modifiers" % (3.14159, 3.14159 / 1000))
#+end_src

#+RESULTS:
: |  positive| and |negative  | space padding
: fixed point 3.1416 and scientific 3.1416e-03 modifiers

**  Set iterals
Sets are containers which behave as math sets:
- they contain just one copy of each value
- it is possible to efficiently test if a value belongs to the sets
more operations on set will be described later

Set literal constructor is the curl brace.

#+begin_src python :eval never-export :results output :exports both
{} # an empty set
{"Hi"} # a set with only one item
print({2,2,3,1,"Joe"}) # duplicate item in literals will be dropped
#+end_src

#+RESULTS:
: {1, 2, 3, 'Joe'}

lists are not allowed to be set values while tuples are. This is related to
their immutability as we will see later
**  Dictionary access
to retrieve a value from a dictionary, its key can be passed through the square
bracket operator

#+begin_src python :eval never-export :results output :exports both
print({"hello":1, 10:True, (1,2,3,4):3.14159}["hello"])
#+end_src

#+RESULTS:
: 1

if the selected key is missing an error is generated
**  Set and dictionary operators
the ~in~ operator can check if an element is part of a set or if there is a key
in a dictionary

#+begin_src python :eval never-export :results output :exports both
print(2 in {10, "Joe", 2})
print(2 in {"hello":1, 10:True, (1,2,3,4):3.14159})
#+end_src

#+RESULTS:
: True
: False

while this operator also works on tuples and lists its time complexity is linear
while it is constant on dictionaries and sets, so it is not recommended to use
it with them.
**  String formatting with modulo and dictionaries
Dictionaries can be used as the right operand in string formatting expressions
with the modulo operator.

This can be useful when
- formatting strings with many data without worrying about order
- rusing the same value multiple times

placeholders modifiers will include key names in parens
#+begin_src python :eval never-export :results output :exports both
print("on %(date)s the temperature is %(temperature).2f degrees" % {"temperature":2.3, "date":"Monday, January 1st"})
print("My name is %(surname)s, %(first name)s %(surname)s" % {"first name":"James", "surname":"Bond"})
#+end_src

#+RESULTS:
: on Monday, January 1st the temperature is 2.30 degree
: My name is Bond, James Bond
